# Solutions for Topic 5 Exercise Sheet

1. Get bus.sql from Moodle and import it into MySQL.

*Done ...*

2. How are the tables in the database related?

*2 Tables bus and driver are related with the bus primary key reg and driver foreign key busreg*

3. Add the following drivers:</br>
“Mary”</br>
“Bob” – licence number “RN2423”</br>
“Sean” – licence number “FF88345” who drives bus “191-G-123”</br>
What happens and why?</br>

*Mary:</br>
ERROR 1364 (HY000): Field 'licenceNo' doesn't have a default value</br>
Bob:</br>
INSERTs with a NULL busreg (no relation to bus)</br>
Sean:</br> 
INSERTs with relation to 191-G-123 bus</br>*

Add the following buses:
"12-G-1323" that can hold up to 34 passengers and runs on "Diesel"
"171-G-885" that can hold up to 84 passengers and runs on "Petrol"
"191-D-45890" that can hold up to 120 passengers and runs on "Ethanol"
What happens and why?

Update driver’s licences that contain the letters “F” or “R” to have the letters “T-“ before
their current licence number.

In [ ]:
USE bus;
 
UPDATE driver SET licenceNo = CONCAT("T-", licenceNo)
WHERE (licenceNo LIKE "%F%" OR licenceNo LIKE "%R%")

Delete driver “Alan”. What happens and why?

In [ ]:
DELETE FROm driver WHERE name = "Alan";

Delete bus “reg = '161-d-1323'”. What happens and why?

In [ ]:
DELETE FROM bus WHERE reg = "161-d-1323";
'''1 Row Deleted

8. Get bus2.sql from Moodle and import it into MySQL. To use this database type use bus2;

*Done ...*

9. Delete bus “161-d-1323”. What happens and why?

In [ ]:
USE bus2;
 
 
START TRANSACTION;
	SELECT * FROM bus;
	SELECT * FROm driver;
    
    DELETE FROM bus WHERE reg = "161-d-1323";
    
	SELECT * FROM bus;
	SELECT * FROm driver;

ROLLBACK;

''' Deletes record in bus, but also a null foreign key for driver Tom (that referenced that bus)

10. Get employees2.sql from Moodle and import it into MySQL. To use this database type use
employees2;

*Done ...*

11. Show the emp_no, first_name and last_name of employees born in the average year.</br>
The average year should be rounded down to the nearest whole number. For example,</br>
• 1949.1 becomes 1949.</br>
• 1949.9 becomes 1949.</br>
• 1949.0 becomes 1949.</br>

In [ ]:
USE employees2;

SELECT emp_no, first_name, last_name
FROM employees 
WHERE YEAR(birth_date) = FLOOR((SELECT AVG(YEAR(e.birth_date)) FROM employees e));

12. Show the emp_no, first_name, last_name and name of the department each employee is in

In [ ]:
USE employees2;

SELECT e.emp_no, e.first_name, e.last_name, d.name AS 'Department'
FROM employees e INNER JOIN salaries s
ON e.emp_no = s.emp_no
INNER JOIN dept d
ON s.dept_no = d.dept_no;